Repository: Mr-Fulani/quiz_project
Catalog: quiz_backend/blog/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Message Details
ru: Детали сообщения

source: Sender
ru: Отправитель

source: Recipient
ru: Получатель

source: Fullname
ru: Полное имя

source: Email
ru: Электронная почта

source: Content
ru: Содержание

source: Created At
ru: Создано

source: Is Read
ru: Прочитано

source: Deleted by Sender
ru: Удалено отправителем

source: Deleted by Recipient
ru: Удалено получателем

source: Attachments
ru: Вложения

source: No file
ru: Нет файла

source: No attachments
ru: Нет вложений

source: Error
ru: Ошибка

source: No message object found in context.
ru: Объект сообщения не найден в контексте.

source: Conversation between
ru: Диалог между

source: Unknown
ru: Неизвестно

source: Filters
ru: Фильтры

source: All
ru: Все

source: Read
ru: Прочитанные

source: Unread
ru: Непрочитанные

source: Action
ru: Действие

source: Mark as read
ru: Отметить как прочитанное

source: Mark as unread
ru: Отметить как непрочитанное

source: Delete selected messages
ru: Удалить выбранные сообщения

source: Apply
ru: Применить

source: Anonymous
ru: Аноним

source: No messages found
ru: Сообщения не найдены

source: Back to dialogs
ru: Вернуться к диалогам

source: Dialogs
ru: Диалоги

source: No dialogs found
ru: Диалоги не найдены

source: Dialog
ru: Диалог

source: Last message
ru: Последнее сообщение

source: Messages
ru: Сообщения

source: Date
ru: Дата

source: Status
ru: Статус

source: Are you sure you want to delete the selected messages? All attachments will also be deleted.
ru: Вы уверены, что хотите удалить выбранные сообщения? Все вложения также будут удалены.

source: Yes, I am sure
ru: Да, я уверен

source: Cancel
ru: Отмена

source: Preview
ru: Предпросмотр

source: Excerpt
ru: Отрывок

source: Description
ru: Описание

source: Not determined
ru: Не определено

source: Yandex Zen
ru: Яндекс Дзен

source: I create high-load web applications, functional websites, powerful Telegram bots of any complexity, business cards and other digital solutions.
ru: Я создаю высоконагруженные веб-приложения, функциональные сайты, мощные Telegram-боты любой сложности, визитки и другие цифровые решения.

source: I use microservice architecture, modular approach, modern databases and optimized APIs. This allows you to develop flexible, reliable and scalable projects that are easily adapted to any tasks.
ru: Я использую микросервисную архитектуру, модульный подход, современные базы данных и оптимизированные API. Это позволяет разрабатывать гибкие, надежные и масштабируемые проекты, легко адаптируемые под любые задачи.

source: This blog is not only a business card, but also a useful resource for developers. Here I share: educational materials, guides and examples that will help you improve your programming skills.
ru: Этот блог — не только визитка, но и полезный ресурс для разработчиков. Здесь я делюсь: учебными материалами, руководствами и примерами, которые помогут улучшить ваши навыки программирования.

source: Whether it's process automation, integration with external services or creating a unique digital product - I will help bring your idea to life in a reliable and elegant solution.
ru: Будь то автоматизация процессов, интеграция с внешними сервисами или создание уникального цифрового продукта — я помогу воплотить вашу идею в надежное и элегантное решение.

source: Welcome to QuizHub - your resource for programming and quizzes. Here you will find the latest news, detailed guides and practical tips covering everything from Python to React.
ru: Добро пожаловать в QuizHub — ваш ресурс для программирования и квизов. Здесь вы найдете последние новости, подробные руководства и практические советы, охватывающие все — от Python до React.

source: On our site you can learn new technologies, take exciting interactive quizzes and track your progress with detailed statistics.
ru: На нашем сайте вы можете изучать новые технологии, проходить увлекательные интерактивные квизы и отслеживать свой прогресс с помощью подробной статистики.

source: We strive to make learning programming accessible, interesting and effective for everyone, whether you are a beginner or a professional.
ru: Мы стремимся сделать изучение программирования доступным, интересным и эффективным для всех, будь вы новичок или профессионал.

source: Start your learning right now - dive into the world of code, take quizzes, improve your skills and track your growth.
ru: Начните обучение прямо сейчас — погрузитесь в мир кода, проходите квизы, улучшайте свои навыки и отслеживайте свой рост.

source: Quiz Project
ru: Квиз Проект

source: Welcome to Quiz Project — blog and portfolio with quizzes and projects.
ru: Добро пожаловать в Квиз Проект — блог и портфолио с квизами и проектами.

source: quiz, blog, portfolio, projects, programming
ru: квиз, блог, портфолио, проекты, программирование

source: Resume — Quiz Project
ru: Резюме — Квиз Проект

source: My professional resume with experience and skills.
ru: Мое профессиональное резюме с опытом и навыками.

source: resume, programmer, portfolio
ru: резюме, программист, портфолио

source: About Me — Quiz Project
ru: Обо мне — Квиз Проект

source: Learn more about me and my projects.
ru: Узнайте больше обо мне и моих проектах.

source: about me, developer, programming
ru: обо мне, разработчик, программирование

source: Contact — Quiz Project
ru: Контакты — Квиз Проект

source: Contact me for collaboration or questions.
ru: Свяжитесь со мной для сотрудничества или вопросов.

source: contact, programmer, collaboration
ru: контакты, программист, сотрудничество

source: About me
ru: Обо мне

source: What I do
ru: Что я делаю

source: Development of websites and web applications
ru: Разработка сайтов и веб-приложений

source: Web development icon
ru: Иконка веб-разработки

source: Web Development
ru: Веб-разработка

source: High-quality website development at a professional level.
ru: Качественная разработка сайтов на профессиональном уровне.

source: Development of Telegram mini-apps
ru: Разработка мини-приложений для Telegram

source: Telegram Mini Apps icon
ru: Иконка мини-приложений Telegram

source: Telegram Mini-App
ru: Мини-приложение Telegram

source: Development of interactive mini-applications for Telegram with integration into the messenger ecosystem.
ru: Разработка интерактивных мини-приложений для Telegram с интеграцией в экосистему мессенджера.

source: Creation of Telegram bots
ru: Создание Telegram-ботов

source: Telegram bots icon
ru: Иконка Telegram-ботов

source: Telegram Bots
ru: Telegram-боты

source: Development of Telegram bots of any complexity with integration into various APIs.
ru: Разработка Telegram-ботов любой сложности с интеграцией в различные API.

source: Business process automation
ru: Автоматизация бизнес-процессов

source: Automation icon
ru: Иконка автоматизации

source: Automation
ru: Автоматизация

source: Creating scripts and programs to automate routine tasks and business processes.
ru: Создание скриптов и программ для автоматизации рутинных задач и бизнес-процессов.

source: All Feedback
ru: Все отзывы

source: Leave Feedback
ru: Оставить отзыв

source: My Skills
ru: Мои навыки

source: All Reviews
ru: Все отзывы

source: avatar
ru: аватар

source: Previous
ru: Предыдущая

source: Next
ru: Следующая

source: No reviews yet
ru: Пока нет отзывов

source: Modal windows
ru: Модальные окна

source: Home
ru: Главная

source: Posts
ru: Посты

source: Quizzes
ru: Квизы

source: Users
ru: Пользователи

source: Profile
ru: Профиль

source: Logout
ru: Выйти

source: Login
ru: Войти

source: English
ru: Английский

source: Blog
ru: Блог

source: Filter
ru: Фильтр

source: No Image
ru: Нет изображения

source: No posts yet, but we're working on it!
ru: Пока нет постов, но мы работаем над этим!

source: New posts will appear soon, stay tuned!
ru: Новые посты скоро появятся, следите за обновлениями!

source: Contact
ru: Контакты

source: Contact Form
ru: Форма обратной связи

source: Full name
ru: Полное имя

source: Email address
ru: Адрес электронной почты

source: Your Message
ru: Ваше сообщение

source: Send Message
ru: Отправить сообщение

source: Message sent!
ru: Сообщение отправлено!

source: Error:
ru: Ошибка:

source: Server error
ru: Ошибка сервера

source: View Profile
ru: Посмотреть профиль

source: Your Feedback:
ru: Ваш отзыв:

source: Share your experience...
ru: Поделитесь своим опытом...

source: Submit Feedback
ru: Отправить отзыв

source: Platform Features
ru: Особенности платформы

source: Quiz Icon
ru: Иконка квиза

source: Tasks and Quizzes
ru: Задачи и квизы

source: Practice solving tasks of varying difficulty, from basics to advanced programming topics.
ru: Практикуйтесь в решении задач разной сложности, от основ до продвинутых тем программирования.

source: Statistics Icon
ru: Иконка статистики

source: Statistics and Analytics
ru: Статистика и аналитика

source: Detailed statistics on topics, technologies, top-50 user rankings, and progress charts.
ru: Подробная статистика по темам, технологиям, рейтингам топ-50 пользователей и графикам прогресса.

source: Learning Icon
ru: Иконка обучения

source: Learning Materials
ru: Учебные материалы

source: Useful articles, libraries, frameworks, and learning resources for developers.
ru: Полезные статьи, библиотеки, фреймворки и учебные ресурсы для разработчиков.

source: Chat Icon
ru: Иконка чата

source: Communication
ru: Коммуникация

source: Discuss tasks, share experiences, and connect with other developers in our chat.
ru: Обсуждайте задачи, делитесь опытом и общайтесь с другими разработчиками в нашем чате.

source: Top Users
ru: Топ пользователей

source: Rank
ru: Ранг

source: Points
ru: Очки

source: Quizzes Completed
ru: Пройдено квизов

source: Average Score
ru: Средний балл

source: Favorite Category
ru: Любимая категория

source: No user data available yet
ru: Данные пользователей пока недоступны

source: Statistics
ru: Статистика

source: Our Resources
ru: Наши ресурсы

source: Popular Quizzes
ru: Популярные квизы

source: Programming Basics
ru: Основы программирования

source: 80%% popularity
ru: 80%% популярности

source: World History
ru: Всемирная история

source: 70%% popularity
ru: 70%% популярности

source: Science Quiz
ru: Научный квиз

source: 90%% popularity
ru: 90%% популярности

source: Literature Masters
ru: Мастера литературы

source: 50%% popularity
ru: 50%% популярности

source: Jan
ru: Янв

source: Feb
ru: Фев

source: Mar
ru: Мар

source: Apr
ru: Апр

source: May
ru: Май

source: Jun
ru: Июн

source: Number of Attempts
ru: Количество попыток

source: Under Development
ru: В разработке

source: under construction
ru: в стадии строительства

source: Chat functionality is under development
ru: Функционал чата в разработке

source: We are working to make communication on the platform convenient and useful. This feature will be available soon!
ru: Мы работаем над тем, чтобы сделать коммуникацию на платформе удобной и полезной. Эта функция скоро будет доступна!

source: Return to Home
ru: Вернуться на главную

source: Portfolio
ru: Портфолио

source: No projects yet, but we're working on it!
ru: Пока нет проектов, но мы работаем над этим!

source: New projects will appear soon, stay tuned!
ru: Новые проекты скоро появятся, следите за обновлениями!

source: Your browser does not support the video tag.
ru: Ваш браузер не поддерживает тег видео.

source: No media available
ru: Медиа недоступно

source: Live Demo
ru: Живая демо

source: Available Subtopics
ru: Доступные подтемы

source: %(subtopic_name)s icon
ru: Иконка %(subtopic_name)s

source: Test on subtopic
ru: Тест по подтеме

source: No subtopics available for
ru: Нет доступных подтем для

source: View my progress
ru: Посмотреть мой прогресс

source: Log in to track progress
ru: Войдите, чтобы отслеживать прогресс

source: Difficulty
ru: Сложность

source: Available Difficulty Levels
ru: Доступные уровни сложности

source: %(difficulty_name)s icon
ru: Иконка %(difficulty_name)s

source: Tasks of level
ru: Задачи уровня

source: No difficulty levels available
ru: Нет доступных уровней сложности

source: Image is missing.
ru: Изображение отсутствует.

source: Translation is missing. Please contact the administrator.
ru: Перевод отсутствует. Пожалуйста, свяжитесь с администратором.

source: Are you sure you want to retake the test? Statistics for the subtopic
ru: Вы уверены, что хотите пересдать тест? Статистика по подтеме

source: will be reset.
ru: будет сброшена.

source: Retake Test
ru: Пересдать тест

source: View My Progress
ru: Посмотреть мой прогресс

source: Login to track progress
ru: Войдите, чтобы отслеживать прогресс

source: Page
ru: Страница

source: of
ru: из

source: Error resetting statistics.
ru: Ошибка при сбросе статистики.

source: An error occurred while resetting statistics.
ru: Произошла ошибка при сбросе статистики.

source: Available Topics
ru: Доступные темы

source: %(topic_name)s icon
ru: Иконка %(topic_name)s

source: Test on topic
ru: Тест по теме

source: No topics available
ru: Нет доступных тем

source: I don't know, but I want to learn
ru: Я не знаю, но хочу узнать
